ansible_cucm/cucmv2/roles/CUCM_axl_setup/files/AxlCmds/AXL_addTransPattern.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/11.5">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:addTransPattern sequence="?">
         <transPattern>
            <pattern>90.!</pattern>
            <description>Flash Override (FO) precedence</description>
            <usage>Translation</usage>
            <routePartitionName uuid="?">FlashOverride_PT</routePartitionName>
            <provideOutsideDialtone>true</provideOutsideDialtone>
            <patternUrgency>true</patternUrgency>
            <patternPrecedence>Flash Override</patternPrecedence>
            <callingSearchSpaceName uuid="?">Internal_External_CSS</callingSearchSpaceName>
         </transPattern>
      </ns:addTransPattern>
   </soapenv:Body>
</soapenv:Envelope>